cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxj.svd
        <!-- REGISTER "BAUDRATE" -->
        <register>
          <name>BAUDRATE</name>
          <description>Baud Rate Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0174</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LITTLESTEP" -->
            <field>
              <name>LITTLESTEP</name>
              <description>Little step bit for baud rate</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRREG" -->
            <field>
              <name>BRREG</name>
              <description>Baud rate register bits</description>
              <msb>14</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GUARDTIMER" -->
        <register>
          <name>GUARDTIMER</name>
          <description>Guard Timer Register</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GTREG" -->
            <field>
              <name>GTREG</name>
              <description>Guard time in ETUs</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IDLETIMER" -->
        <register>
          <name>IDLETIMER</name>
          <description>Idle Timer Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IDTREG" -->
            <field>
              <name>IDTREG</name>
              <description>Reload value for idle timer</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GLOBALCONTROL2" -->
        <register>
          <name>GLOBALCONTROL2</name>
          <description>Global Control Register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0008</resetValue>
          <resetMask>0x000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICCDISABLE" -->
            <field>
              <name>ICCDISABLE</name>
              <description>ICC disable/enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INVDATAOUT" -->
            <field>
              <name>INVDATAOUT</name>
              <description>Output inversion enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RX8N1" -->
            <field>
              <name>RX8N1</name>
              <description>Serial data output enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DATA_FIFO" -->
        <register>
          <name>DATA_FIFO</name>
          <description>FIFO Access Register</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x01FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA" -->
            <field>
              <name>DATA</name>
              <description>Transmit/Received data</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_LEVEL_READ" -->
        <register>
          <name>FIFO_LEVEL_READ</name>
          <description>Read FIFO Level Register</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FIFORDLEVEL" -->
            <field>
              <name>FIFORDLEVEL</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_LEVEL_WRITE" -->
        <register>
          <name>FIFO_LEVEL_WRITE</name>
          <description>Write FIFO Level Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FIFOWRLEVEL" -->
            <field>
              <name>FIFOWRLEVEL</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_MODE" -->
        <register>
          <name>FIFO_MODE</name>
          <description>FIFO Mode Register</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDFIFOLEVEL" -->
            <field>
              <name>RDFIFOLEVEL</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRFIFOLEVEL" -->
            <field>
              <name>WRFIFOLEVEL</name>
              <description>Write FIFO level</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDFIFOIRQEN" -->
            <field>
              <name>RDFIFOIRQEN</name>
              <description>Read FIFO full interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRFIFOIRQEN" -->
            <field>
              <name>WRFIFOIRQEN</name>
              <description>Write FIFO empty interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDFIFOOVRIRQEN" -->
            <field>
              <name>RDFIFOOVRIRQEN</name>
              <description>Read FIFO overflow interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FIFOEN" -->
            <field>
              <name>FIFOEN</name>
              <description>FIFO enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_CLEAR_MSB_WRITE" -->
        <register>
          <name>FIFO_CLEAR_MSB_WRITE</name>
          <description>Write FIFO Clear Register</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLRWRFIFO" -->
            <field>
              <name>CLRWRFIFO</name>
              <description>Write FIFO clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_CLEAR_MSB_READ" -->
        <register>
          <name>FIFO_CLEAR_MSB_READ</name>
          <description>Read FIFO Clear Register</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLRRDFIFO" -->
            <field>
              <name>CLRRDFIFO</name>
              <description>Read FIFO clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ_STATUS" -->
        <register>
          <name>IRQ_STATUS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXFULIRQ" -->
            <field>
              <name>RXFULIRQ</name>
              <description>Received data register full interrupt flag bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXEMPIRQ" -->
            <field>
              <name>TXEMPIRQ</name>
              <description>Transmit data register empty interrupt flag bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXSTBIIRQ" -->
            <field>
              <name>RXSTBIIRQ</name>
              <description>Received start bit interrupt flag bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDEVENTIRQ" -->
            <field>
              <name>CARDEVENTIRQ</name>
              <description>Card event interrupt flag bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IDTEXPIRQ" -->
            <field>
              <name>IDTEXPIRQ</name>
              <description>Idle timer expired interrupt flag bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDFIFOIRQ" -->
            <field>
              <name>RDFIFOIRQ</name>
              <description>Read FIFO full interrupt flag bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRFIFOIRQ" -->
            <field>
              <name>WRFIFOIRQ</name>
              <description>Write FIFO empty interrupt flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDFIFOOVRIRQ" -->
            <field>
              <name>RDFIFOOVRIRQ</name>
              <description>Read FIFO overflow interrupt flag bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
