cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxj.svd
        <!-- REGISTER "TMSP" -->
        <register>
          <name>TMSP</name>
          <description>Time Stamp Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMSP" -->
            <field>
              <name>TMSP</name>
              <description>Time Stamp bits</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCS" -->
        <register>
          <name>UDCS</name>
          <description>UDC Status Register</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description>Suspend detection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOF" -->
            <field>
              <name>SOF</name>
              <description>SOF Detection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRST" -->
            <field>
              <name>BRST</name>
              <description>Bus Reset Detection bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUP" -->
            <field>
              <name>WKUP</name>
              <description>Wake-up Detection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SETP" -->
            <field>
              <name>SETP</name>
              <description>Setup Stage Detection bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONF" -->
            <field>
              <name>CONF</name>
              <description>Configuration Detection bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCIE" -->
        <register>
          <name>UDCIE</name>
          <description>UDC Interrupt Enable Register</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSPIE" -->
            <field>
              <name>SUSPIE</name>
              <description>Suspend Interrupt Enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIE" -->
            <field>
              <name>SOFIE</name>
              <description>SOF Reception Interrupt Enable bit </description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRSTIE" -->
            <field>
              <name>BRSTIE</name>
              <description>Bus Reset Enable bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUPIE" -->
            <field>
              <name>WKUPIE</name>
              <description>Wake-up Interrupt Enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONFN" -->
            <field>
              <name>CONFN</name>
              <description>Configuration Number Indication bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CONFIE" -->
            <field>
              <name>CONFIE</name>
              <description>Configuration Interrupt Enable bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0IS" -->
        <register>
          <name>EP0IS</name>
          <description>EP0I Status Register</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8400</resetValue>
          <resetMask>0xC400</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send Buffer Initialization bit </description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIIE" -->
            <field>
              <name>DRQIIE</name>
              <description>Send Data Interrupt Enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQI" -->
            <field>
              <name>DRQI</name>
              <description>Send/Receive Data Interrupt Request bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0OS" -->
        <register>
          <name>EP0OS</name>
          <description>EP0O Status Register</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xE67F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Receive Buffer Initialization bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQOIE" -->
            <field>
              <name>DRQOIE</name>
              <description>Receive Data Interrupt Enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit </description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQO" -->
            <field>
              <name>DRQO</name>
              <description>Receive Data Interrupt Request bit </description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>Packet Size Indication bit</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1S" -->
        <register>
          <name>EP1S</name>
          <description>EP1 Status Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send/Receive Buffer Initialization bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description>Packet Transfer Interrupt Enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy Flag bit </description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description>Packet Transfer Interrupt Request bit </description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>packet SIZE</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP2S" -->
        <register>
          <name>EP2S</name>
          <description>EP2 Status Register</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send/Receive Buffer Initialization bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description>Packet Transfer Interrupt Enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy Flag bit </description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description>Packet Transfer Interrupt Request bit </description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>packet SIZE</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3S" -->
        <register derivedFrom="EP2S">
          <name>EP3S</name>
          <description>EP3 Status Register</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "EP4S" -->
        <register derivedFrom="EP2S">
          <name>EP4S</name>
          <description>EP4 Status Register</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "EP5S" -->
        <register derivedFrom="EP2S">
          <name>EP5S</name>
          <description>EP5 Status Register</description>
          <addressOffset>0x5C</addressOffset>
        </register>
