cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxj.svd
        <!-- REGISTER "MAR6L" -->
        <register derivedFrom="MAR1L">
          <name>MAR6L</name>
          <description>MAC Address6 Register -Low</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "MAR7H" -->
        <register derivedFrom="MAR1H">
          <name>MAR7H</name>
          <description>MAC Address7 Register -High</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "MAR7L" -->
        <register derivedFrom="MAR1L">
          <name>MAR7L</name>
          <description>MAC Address7 Register -Low</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "MAR8H" -->
        <register derivedFrom="MAR1H">
          <name>MAR8H</name>
          <description>MAC Address8 Register -High</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "MAR8L" -->
        <register derivedFrom="MAR1L">
          <name>MAR8L</name>
          <description>MAC Address8 Register -Low</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "MAR9H" -->
        <register derivedFrom="MAR1H">
          <name>MAR9H</name>
          <description>MAC Address9 Register -High</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "MAR9L" -->
        <register derivedFrom="MAR1L">
          <name>MAR9L</name>
          <description>MAC Address9 Register -Low</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "MAR10H" -->
        <register derivedFrom="MAR1H">
          <name>MAR10H</name>
          <description>MAC Address10 Register -High</description>
          <addressOffset>0x90</addressOffset>
        </register>
        <!-- REGISTER "MAR10L" -->
        <register derivedFrom="MAR1L">
          <name>MAR10L</name>
          <description>MAC Address10 Register -Low</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "MAR11H" -->
        <register derivedFrom="MAR1H">
          <name>MAR11H</name>
          <description>MAC Address11 Register -High</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "MAR11L" -->
        <register derivedFrom="MAR1L">
          <name>MAR11L</name>
          <description>MAC Address11 Register -Low</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "MAR12H" -->
        <register derivedFrom="MAR1H">
          <name>MAR12H</name>
          <description>MAC Address12 Register -High</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "MAR12L" -->
        <register derivedFrom="MAR1L">
          <name>MAR12L</name>
          <description>MAC Address12 Register -Low</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "MAR13H" -->
        <register derivedFrom="MAR1H">
          <name>MAR13H</name>
          <description>MAC Address13 Register -High</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "MAR13L" -->
        <register derivedFrom="MAR1L">
          <name>MAR13L</name>
          <description>MAC Address13 Register -Low</description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "MAR14H" -->
        <register derivedFrom="MAR1H">
          <name>MAR14H</name>
          <description>MAC Address14 Register -High</description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "MAR14L" -->
        <register derivedFrom="MAR1L">
          <name>MAR14L</name>
          <description>MAC Address14 Register -Low</description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "MAR15H" -->
        <register derivedFrom="MAR1H">
          <name>MAR15H</name>
          <description>MAC Address15 Register -High</description>
          <addressOffset>0xB8</addressOffset>
        </register>
        <!-- REGISTER "MAR15L" -->
        <register derivedFrom="MAR1L">
          <name>MAR15L</name>
          <description>MAC Address15 Register -Low</description>
          <addressOffset>0xBC</addressOffset>
        </register>
        <!-- REGISTER "RGSR" -->
        <register>
          <name>RGSR</name>
          <description>RGMII Status Register)</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LS" -->
            <field>
              <name>LS</name>
              <description>Link Status</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LSP" -->
            <field>
              <name>LSP</name>
              <description>Link Speed</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description>Link Mode</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMC_CNTL" -->
        <register>
          <name>MMC_CNTL</name>
          <description>MMC Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "B" -->
            <field>
              <name>B</name>
              <description>Bits of MMC_CNTL</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
