cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxj.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ETHERNET_CONTROL" -->
    <peripheral>
      <name>ETHERNET_CONTROL</name>
      <description>Ethernet system control</description>
      <version>A</version>
      <groupName>ETHERNET_CONTROL</groupName>
      <baseAddress>0x40066000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ETH_MODE" -->
        <register>
          <name>ETH_MODE</name>
          <description>Mode Select Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x10000301</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPSSEL" -->
            <field>
              <name>PPSSEL</name>
              <description>Select either of the system time counter pulse outputs of the Ethernet-MAC PTP function to output to E_PPS0_PPS1 pin</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST1" -->
            <field>
              <name>RST1</name>
              <description>reset signal against Ethernet-MAC (ch.1)</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST0" -->
            <field>
              <name>RST0</name>
              <description>reset signal against Ethernet-MAC (ch.0)</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IFMODE" -->
            <field>
              <name>IFMODE</name>
              <description>Mode selector</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ETH_CLKG" -->
        <register>
          <name>ETH_CLKG</name>
          <description>Clock Gating Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MACEN" -->
            <field>
              <name>MACEN</name>
              <description>Select the system clock supply to Ethernet-MAC</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDIF" -->
    <peripheral>
      <name>SDIF</name>
      <description>SD Card Interface</description>
      <version>A</version>
      <groupName>SDIF</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x55</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x118</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x144</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "SD" -->
      <interrupt>
        <name>SD</name>
        <value>118</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SSA2" -->
        <register>
          <name>SSA2</name>
          <description>SDMA System Address / Argument 2 Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "SBSIZE" -->
        <register>
          <name>SBSIZE</name>
          <description>Block Size Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSDMABUFBD" -->
            <field>
              <name>HSDMABUFBD</name>
              <description>Host SDMA Buffer Boundary</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRSFBLCKSZ" -->
            <field>
              <name>TRSFBLCKSZ</name>
              <description>Transfer Block Size</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SBLCNT" -->
        <register>
          <name>SBLCNT</name>
          <description>Block Count Register</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
